MicroTrident/MicroTrident8266/boards.txt
##############################################################
thing.name=SparkFun ESP8266 Thing
thing.build.board=ESP8266_THING
thing.build.variant=thing
thing.upload.tool=esptool
thing.upload.maximum_data_size=81920
thing.upload.wait_for_upload_port=true
thing.upload.erase_cmd=
thing.serial.disableDTR=true
thing.serial.disableRTS=true
thing.build.mcu=esp8266
thing.build.core=esp8266
thing.build.spiffs_pagesize=256
thing.build.debug_port=
thing.build.debug_level=
thing.menu.CpuFrequency.80=80 MHz
thing.menu.CpuFrequency.80.build.f_cpu=80000000L
thing.menu.CpuFrequency.160=160 MHz
thing.menu.CpuFrequency.160.build.f_cpu=160000000L
thing.upload.resetmethod=ck
thing.build.flash_mode=qio
thing.build.flash_freq=40
thing.menu.FlashSize.512K0=512K (no SPIFFS)
thing.menu.FlashSize.512K0.build.flash_size=512K
thing.menu.FlashSize.512K0.build.flash_size_bytes=0x80000
thing.menu.FlashSize.512K0.build.flash_ld=eagle.flash.512k0.ld
thing.menu.FlashSize.512K0.build.spiffs_pagesize=256
thing.menu.FlashSize.512K0.upload.maximum_size=499696
thing.menu.FlashSize.512K0.build.rfcal_addr=0x7C000
thing.menu.FlashSize.512K64=512K (64K SPIFFS)
thing.menu.FlashSize.512K64.build.flash_size=512K
thing.menu.FlashSize.512K64.build.flash_size_bytes=0x80000
thing.menu.FlashSize.512K64.build.flash_ld=eagle.flash.512k64.ld
thing.menu.FlashSize.512K64.build.spiffs_pagesize=256
thing.menu.FlashSize.512K64.upload.maximum_size=434160
thing.menu.FlashSize.512K64.build.rfcal_addr=0x7C000
thing.menu.FlashSize.512K64.build.spiffs_start=0x6B000
thing.menu.FlashSize.512K64.build.spiffs_end=0x7B000
thing.menu.FlashSize.512K64.build.spiffs_blocksize=4096
thing.menu.FlashSize.512K128=512K (128K SPIFFS)
thing.menu.FlashSize.512K128.build.flash_size=512K
thing.menu.FlashSize.512K128.build.flash_size_bytes=0x80000
thing.menu.FlashSize.512K128.build.flash_ld=eagle.flash.512k128.ld
thing.menu.FlashSize.512K128.build.spiffs_pagesize=256
thing.menu.FlashSize.512K128.upload.maximum_size=368624
thing.menu.FlashSize.512K128.build.rfcal_addr=0x7C000
thing.menu.FlashSize.512K128.build.spiffs_start=0x5B000
thing.menu.FlashSize.512K128.build.spiffs_end=0x7B000
thing.menu.FlashSize.512K128.build.spiffs_blocksize=4096
thing.menu.Debug.Disabled=Disabled
thing.menu.Debug.Disabled.build.debug_port=
thing.menu.Debug.Serial=Serial
thing.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
thing.menu.Debug.Serial1=Serial1
thing.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
thing.menu.DebugLevel.None____=None
thing.menu.DebugLevel.None____.build.debug_level=
thing.menu.DebugLevel.SSL=SSL
thing.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
thing.menu.DebugLevel.TLS_MEM=TLS_MEM
thing.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
thing.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
thing.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
thing.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
thing.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
thing.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
thing.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
thing.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
thing.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
thing.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
thing.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
thing.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
thing.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thing.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
thing.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thing.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
thing.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thing.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
thing.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thing.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
thing.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thing.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
thing.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thing.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thing.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thing.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thing.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thing.menu.DebugLevel.CORE=CORE
thing.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
thing.menu.DebugLevel.WIFI=WIFI
thing.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
thing.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
thing.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
thing.menu.DebugLevel.UPDATER=UPDATER
thing.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
thing.menu.DebugLevel.OTA=OTA
thing.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
thing.menu.DebugLevel.OOM=OOM
thing.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
thing.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
thing.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
thing.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
thing.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
thing.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
thing.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
thing.menu.FlashErase.none=Only Sketch
thing.menu.FlashErase.none.upload.erase_cmd=
thing.menu.FlashErase.sdk=Sketch + WiFi Settings
thing.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
thing.menu.FlashErase.all=All Flash Contents
thing.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
thing.menu.UploadSpeed.115200=115200
thing.menu.UploadSpeed.115200.upload.speed=115200
thing.menu.UploadSpeed.9600=9600
thing.menu.UploadSpeed.9600.upload.speed=9600
thing.menu.UploadSpeed.57600=57600
thing.menu.UploadSpeed.57600.upload.speed=57600
thing.menu.UploadSpeed.230400.linux=230400
thing.menu.UploadSpeed.230400.macosx=230400
thing.menu.UploadSpeed.230400.upload.speed=230400
thing.menu.UploadSpeed.256000.windows=256000
thing.menu.UploadSpeed.256000.upload.speed=256000
thing.menu.UploadSpeed.460800.linux=460800
thing.menu.UploadSpeed.460800.macosx=460800
thing.menu.UploadSpeed.460800.upload.speed=460800
thing.menu.UploadSpeed.512000.windows=512000
thing.menu.UploadSpeed.512000.upload.speed=512000
thing.menu.UploadSpeed.921600=921600
thing.menu.UploadSpeed.921600.upload.speed=921600

